{
  "_class_name": "LingBotVideoPipeline",
  "_diffusers_version": "0.37.1",
  "transformer": [
    "lingbot_video.transformer_lingbot_video",
    "LingBotVideoTransformer3DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLWan"
  ],
  "text_encoder": [
    "transformers",
    "Qwen3VLForConditionalGeneration"
  ],
  "processor": [
    "transformers",
    "Qwen3VLProcessor"
  ],
  "scheduler": [
    "lingbot_video.scheduling_flow_unipc",
    "FlowUniPCMultistepScheduler"
  ]
}
