{
  "_class_name": "LingBotVideoTransformer3DModel",
  "_diffusers_version": "0.37.0",
  "axes_dims": [
    32,
    48,
    48
  ],
  "axes_lens": [
    8192,
    1024,
    1024
  ],
  "decoder_sparse_step": 1,
  "depth": 24,
  "freq_dim": 256,
  "hidden_size": 2048,
  "in_channels": 16,
  "intermediate_size": 6144,
  "mlp_only_layers": [],
  "moe_intermediate_size": 512,
  "n_group": null,
  "n_shared_experts": null,
  "norm_eps": 1e-06,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "num_experts": 0,
  "num_experts_per_tok": 8,
  "out_bias": true,
  "out_channels": 16,
  "patch_embed_bias": true,
  "patch_size": [
    1,
    2,
    2
  ],
  "qkv_bias": false,
  "rope_theta": 256.0,
  "routed_scaling_factor": 1.0,
  "score_func": "sigmoid",
  "text_dim": 2560,
  "timestep_mlp_bias": true,
  "topk_group": null
}
